In [1]:
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie','Ami'], 'Age': [25, 30, 35,1]}
df = pd.DataFrame(data)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3      Ami    1

In [2]:
#2. Display first 5 rows of a DataFrame
print(df.head())
# Explanation: head() shows the first 5 rows by default.

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3      Ami    1

In [3]:
#3. Display last 3 rows of a DataFrame
print(df.tail(3))
# Explanation: tail() shows the last 3 rows.

      Name  Age
1      Bob   30
2  Charlie   35
3      Ami    1

In [4]:
#4. Get DataFrame information
print(df.info())
# Explanation: info() shows column types, non-null counts, and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes
None

In [5]:
#5. Get statistical summary
print(df.describe())
# Explanation: describe() gives mean, std, min, max, etc. for numeric columns.

             Age
count   4.000000
mean   22.750000
std    15.063753
min     1.000000
25%    19.000000
50%    27.500000
75%    31.250000
max    35.000000

In [6]:
#6. Show column names
print(df.columns)
# Explanation: columns attribute lists all column names.

Index(['Name', 'Age'], dtype='object')

In [7]:
#7. Show index
print(df.index)
# Explanation: index attribute shows row labels.

RangeIndex(start=0, stop=4, step=1)

In [10]:
#8. Select a single column
print(df['Age'])
# Explanation: Accessing column as Series.

0    25
1    30
2    35
3     1
Name: Age, dtype: int64

In [11]:
print(df[['Name', 'Age']])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3      Ami    1

In [12]:
#10. Select a row by index using loc
print(df.loc[0])
# Explanation: loc selects by label/index.

Name    Alice
Age        25
Name: 0, dtype: object

In [13]:
print(df[df['Age'] > 28])

      Name  Age
1      Bob   30
2  Charlie   35

In [40]:
f['NAME'] = f['Age']

In [41]:
f

  FullName  Age Country  NAME
1      Bob   30      UK    30
2  Charlie   35   India    35
3      Ami    1       a     1

In [32]:
dfdf = df.drop('Country', axis=1)

In [34]:
df = df.drop(0)

In [36]:
f = df.rename(columns={'Name': 'FullName'})

In [39]:
f

  FullName  Age Country
1      Bob   30      UK
2  Charlie   35   India
3      Ami    1       a

In [42]:
print(df.sort_values(by='Age'))

      Name  Age Country
3      Ami    1       a
1      Bob   30      UK
2  Charlie   35   India

In [43]:
df['Age'] = df['Age'].astype(float)

In [44]:
print(df['Age'].value_counts())

Age
30.0    1
35.0    1
1.0     1
Name: count, dtype: int64

In [45]:
print(df['Age'].unique())

[30. 35.  1.]

In [ ]:
df['Age'].fillna(df['Age'].mean(), inplace=True)

In [47]:
import numpy as np
df['Senior'] = np.where(df['Age'] > 30, 'Yes', 'No')

In [48]:
df

      Name   Age Country Senior
1      Bob  30.0      UK     No
2  Charlie  35.0   India    Yes
3      Ami   1.0       a     No

In [49]:
df['Age_plus_5'] = df['Age'].apply(lambda x: x + 5)

In [50]:
df

      Name   Age Country Senior  Age_plus_5
1      Bob  30.0      UK     No        35.0
2  Charlie  35.0   India    Yes        40.0
3      Ami   1.0       a     No         6.0